OpenFOAM/MacOS/FlowAroundCylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          260;
        startFace       84340;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          260;
        startFace       84600;
    }
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       84860;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       84980;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       85100;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          84800;
        startFace       85260;
    }
)

// ************************************************************************* //
